/*
算术运算符
  运算符     名称   示例       结果
  +         加     2.3+3     5.3
  -         减     8-15      -7
  *         乘     3*4       12
  /         除     5/2       2
                   5.0/2     2.5
  %         取余数  15%7      1           &&&&&&&&

  若运算符两侧的变量类型不一致，按较宽的数据类型计算得出结果


简写运算符
1.+-
 对于自身相加减
 i++  ++i   i=i+1
 i--  --i   i=i-1
 与其他变量计算时
 int a=10,b;
    b=a++;   //a=11,b=10    //后置时，使用a的旧值，计算结束后，a再加1
 int a=10,b;
    b=++a;   //a=11,b=11    //前置时，a先加1，然后用新值参与计算
2.复合赋值运算符
 <变量><运算符>=<表达式>  等价于  <变量>=<变量><运算符>(<表达式>)
 运算符有+ - * / % <<  >>  &  ^  |


位计算
 <<   >>  略














 */