/*
字符串
1.定义：以'\0'结束的字符序列
2.组成：字符串中只包含可见字符、空白字符、转义字符
3.以常量形式出现的字符串必须由一对双引号引起来（'\0'隐含在末尾，无需写出）
4.字符串长度不含有'\0'
5.空串 ""  只含有'\0'的字符串
6.字符串转字符数组
 int main()
{int i;char b[30];
    char *a="hello world";
    for (i=0;*a!='\0';a++,i++)
    { b[i]=*a;}
     b[i+1]='\0';
    return 0;}



字符数组
1.定义：元素类型为字符的数组称为字符数组
2.定义方法 char str[64];
3.字符数组可保存任意字符序列，若字符序列以'\0'结尾则认为字符数组保存了一个字符串
4.字符写入
 法一   char str[]={'h','e','l','l','o','\0'}
 法二   char str[]="hello"
 若[]不带数字，则根据赋值结果自动给出字符数组的长度，上述例子长度均为6
5.例6-18 字符串倒置





 */