/*
 A 一道水题2022
 B 荷荷学妹赚基金2022
C 倒三角2022
D 荷荷学妹坐地铁2022
E 返航小统计2022
F 水君的价格2022   数据类型的范围
G 阿瓦隆卡牌2022
H 女神的密码1-2022
I 女神的密码2-2022
J 年 度 好 题 2022
K 计算绩点2022
L High Heels!2022
M 数列级数2022
N 字节清零2022
O Yes OK！2022
P 二进制逆序2022
Q 有理有据的送分2022
R 极差平方2022
S 数数入门2022   代码见每个数字出现的次数.h
T 朵朵验证哥德巴赫猜想2022





 数据类型的范围
int	                     −2147483648	2147483647(2^31−1)
unsigned int	                   0	4294967295(2^32−1)
long long	    −9223372036854775808	9223372036854775807(2^63−1)
unsigned long long	               0	18446744073709551615(2^64−1)
若一个int l=−2147483648   则long long ll=l*-1  会得到0，若想得到正确答案，需long long ll=(long long)l*-1
 若int max,min ,long long ll=(max-min)*(max-min);  ll可能得不到正确答案，必须在乘之前强制类型转换。

 */




