/*
 评测结果


AC（Accepted）：已通过。
你的程序通过了所有测试数据，获得分数。
需要注意的是，Accepted ≠ Correct。即：你的程序只是通过了命题人给出的所有数据，依然有存在潜在错误的可能性。

CE（Compile Error）：编译错误。
你的程序存在语法错误（C / C++ 最常见的是缺少分号、缺少括号、使用了中文标点符号或者函数调用错误等等）或者OJ系统不支持的写法（较少见）。
此时应当仔细检查代码在本机能否通过编译，改正后再次提交。

PE（Presentation Error）：输出格式错误。
你的程序几乎能AC了，但是和标准输出数据有点细微的差距（大小写，空格数量，换行数量之类的）。
此时应当仔细观察题目给出的输出样例，确认格式无误（选中数据粘贴到编辑器最为稳妥）。

WA（Wrong Answer）：答案错误。
你程序输出的结果有错误，与期望输出不匹配（也有可能是因为缺少了必要的换行和空格）。
请检查你的程序是否出现了致命的逻辑错误，当然有的时候是因为手滑。

TLE（Time Limit Exceed）：超出运行时间限制。
你的程序可能因为时间效率不高或者出现了死循环，所以未能在规定的时限内运行结束。

MLE（Memory Limit Exceed）：超出运行内存限制。
你的程序占用的内存超过了规定值，可能是因为使用了过大的数组，也可能是没有做到内存释放（较少见）。

REG（Runtime Error （***））：运行时错误。
这种错误分很多种，具体请百度。最常见的是 SIGSEGV，一般是因为访问了不存在的数组元素或者函数调用过多导致爆栈。

OE（Other Error）：其他错误，详询老师或者助教。
 */