/*
CO-2021级C语言程序设计-热身赛
A加法
B求余
C判断成绩
D打印星星
E打印星星
F打印星星
Gdwy考美院
H击败爆炎树**    注意攻击为0的特殊情况
I MRIYA我们回家了(一维最小步数)  ？？
J 呱呱泡蛙的数学卡片（猜谜）？？
K  雀魂绝艺总纲-基础篇（判断麻将糊了没）？？


C1-2021级-航类第1次上机
 A 转义字符输出
 B 字符也是数
 C 一元二次方程
 D 火仙草数
 E 简单的后缀计算
 F 大小写转换
 G 统计成绩
 H 名次预测
 I 时刻2.0  **
 J 科学计数法！  **注意各种特殊情况
1
E1-2021级-航类第1次练习
 A 雪容融               打印雪容融  对于单引号'、双引号"、百分号%、反斜杠\需要转义为\',\",%%,\\
 B 时刻1.0
 C 来计算圣遗物评分吧！
 D 猜猜我是倒还是不倒!     打印三角形
 E 中间位取数
 F 求最大斜率
 G 驼峰命名与短横线命名
 H 计算 ln2           注意log(n)可输出ln2值 log10(n)返回以10为底的对数
 I zhn の 奇妙魔法ln2
 J 810975ln2 * 九把七鸡五连鸡  注意条件判断

 C2-2021级-航类第2次上机
 A 水水的a+b>c       注意变量范围
                        int 可表示数的范围即是 [−2^31,2^31) ，但两个 int 类型的数相加可能会溢出 int ，因此我们可以用 long long 来读入数据，long long 的范围是 [−2^63,2^63) ；
 B 等差数列求和
 C 一元二次方程进阶版
 D LJF的位运算加密     注意如何替换二进制特定位的值
 E 统计字母
 F 小冰的烦恼     注意如何提取二进制的特定位
 G 进制转换plus ***   注意 0,如何十进制转其他进制
 H 原码，反码，补码***  注意正负数的原码、反码与补码
 I 送蚂蚁回家      注意解题思想
 J 双重循环移位***** 注意二进制32个1如何表示和unsigned的运用




 */